---
kind: property
id: P:Autodesk.Revit.DB.Visual.Stone.StoneColor
source: html/cd0119fa-b450-cbcc-02ae-071b6eceb989.htm
---
# Autodesk.Revit.DB.Visual.Stone.StoneColor Property

The property labeled "Image" from the "Stone" schema.

## Syntax (C#)
```csharp
public static string StoneColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.